Dedication
•二"匕*矣七
To Kristin, words cannot express how Ifeel about our life together. I cherish our family and all our adventures. 5
I'm filled each day with loveforyou.
To Aidan, you have been an inspiration to me and have taught me to play and have fun. Watching you grow up has been so rewarding and enjoyable for me. Ifeel lucky to be able to partake in your life; it has made me a better person.
To My New Baby Boy (shipping QI 2008), you have been wantedfor so long it's hard to believe that you re almost here. You bring completeness and balance to our family. I look forward to playing with you, learning who you are, and enjoying our time together.
—Jeffrey Richter
To my wife Florence, au moins cette fois c est dcrit: je t aime Flo.
To my parents who cannot believe that learning English with Dungeons & Dragons rules could have been so efficient.
—Christophe Nasarre
■ ,•'：.，嫌S .-f-Vv•- ? - •' ：策-
一、9
2) alt y
二8
Hello to my Chinese readers,
寄语中国读者1
浩顷京斜".做礴顿
I have visited your country several times now and am
always in awe at the beauty and rich culture that you hsve
On each visit, I have made some firiends and everyone has always been very gracious towards me.
I am very pleased to know that my book has been translated into your native language and I hope that you enjoy reading it as much as I enjoyed producing it.
Many years ago, operating systems were small enough that it was possible to understand the entire system.
Ml粉，

•	数据库中的信息布局非常复杂，许多开发人员都怕用它，这妨碍了它的流行
为了更方便地使用这个数据库，Microsoft创建了一套Performance Data Helper函数（包含在 PDH.dll中）。要想进一步了解这个函数库，请在Platform SDK文档中搜索Performance Data Helpero
正如刚才提到的那样，Windows 95和Windows 98没有提供这个性能数据库。它们有自己 的一套函数可用来枚举进程及相关信息。这些函数在ToolHelp API中。欲知详情，请在 Platform SDK 文档中搜索 Process32First 和 Process32Next 函数。
有趣的是,Windows NT开发团队不喜欢ToolHelp函数,所以没有把它们加入Windows NT。 相反，他们自行开发了 Process Status函数（包含在PSAPI.dll中）来枚举进程。欲知详情，请 在Platform SDK文档中搜索EnumProcesses函数.
虽然从表面上看,Microsoft也许是想为工具和实用程序的开发人员增加难度，但从Windows 2000开始，Tool Help函数终于在Windows操作系统中现身了。现在，开发人员终于可以 使用一套通用的源代码为Windows 95、Windows 98.直至Windows Vista写出适用性更
强的工具和实用程序。
第4章进程
4.5.5	Process Information 示例程序
Processlnfb应用程序（04-Processlnfb.exe）展示了如何利用各种ToolHelp函数来写一个非常 有用的实用程序。这个应用程序的源代码和资源文件可以在本书配套网页的04-ProcessInfb 目录中找到。启动该程序后，将显示图4V所示的窗口。
图4-4运行中的Processinfo
Processinfo首先枚举目前正在运行的所有进程，将每个进程的名称和ID添加到顶部的组合 框内。然后，选中第一个进程并在下方的只读编辑框中显示与这个进程有关的信息。可以 看出所见，程序显示了进程ID、命令行、所有者、父进程ID、进程的优先级类（PriorityClass） 以及在此进程的上下文中运行的线程数。虽然大多数信息都超出了本章的范围，但我们会 在后续的各章中陆续讨论。
查看进程列表时，可以使用VMMap菜单（查看模块信息时，这个菜单是禁用的）。选择 VMMap菜单，会运行VMMap示例程序（将在第14章讨论）。这个程序将遍历所选进程的 地址空间。
在模块信息（Module Information）g域，列出了映射到进程地址空间的模块（可执行文件和 DLL）。所谓Fixed（固定）模块，是指在进程初始化时隐式载入的模块。对于显式载入的DLL, 会显示其使用计数。第二列显示的是模块映射到的内存地址。如果模块没有映射到它首选 的基地址，则首选基地址会在圆括号中显示。第三列显示模块大小（以KB为单位）。最后一 列显示的是模块的完整路径名。在线程信息（Thread Information）区域，显示了当前在此进程 上下文中运行的所有线程，每个线程的ID和优先级都在此显示。
除了线程信息，还可以选择Modules!菜单项。这将使Processlnfb在整个系统中枚举目前已 载入的所有模块，并将每个模块的名称添加到顶部的组合框中。然后，Processinfo选中第
Windows核心编程(第5版)
一个模块并显示其相关信息，如图4.5所示。
Processed Modulesl VMMapI
Pathnau: C:\Vindovs\systeM32\PSAPI.DLL

Process Infor®ation:
PID
000006D0
00000A84
000007E0
0000026C
000009CC
00000970
00000EB8
BoscAdciT 76420000 76420000 76420000 76420000 76420000 76420000 76420000
explorer. exe MSASCui.exe sidebar.exe
unsecapp.exe
04 Processinfo.exes


图4-5 Processinfo显示了进程地址空间内加载了 Psapi.dll的所有进程
以这种方式使用Processinfo实用程序时，可以很容易地判断出哪些进程正在使用一个特定 的模块。模块的完整路径显示在顶部。在下方的Process Information(进程信息)区域，显示 了包含此模块的所有进程的一个列表。除了每个进程的ID和名称，还显示了模块加载到每 个进程的什么地址。
简单地说,Processinfo应用程序显示的所有信息都是通过调用各种ToolHelp函数来生成的。 为了使ToolHelp函数更易于使用，我创建了一个名为Ctoolhelp的C廿类(包含在Toolhelp.h 文件中)。这个C++类对生成的ToolHelp快照进行封装，并简化了对其他ToolHelp函数的 调用。
Processinfb.cpp 中的 GetModulePreferredBaseAddr 函数特别有意思：
PVOID GetModulePreferredBaseAddr(
DWORD dwProcessId,
PVOID pvModu1eRemot e)；
此函数接受一个进程ID以及这个进程内的一个模块的地址作为参数。然后，它会查看那个 进程的地址空间，定位那个模块，然后读取模块的文件头信息以确定这个模块的首选基地 址。模块应该始终加载到它的首选基地址；否则，使用此模块的应用程序在初始化的时候 就需要更多的内存，导致其性能受到影响。因为这是一个比较糟糕的情形，所以我特地添 加了这个函数，这样一来，当一个模块未能在首选基地址加载的时候，程序就可以将这种 情况显示出来。第20章将进一步介绍首选基地址及其对时间和内存性能的影响。
C..	器
进程的命令行不能直接获得。正如MSDN Magazine题为“Escape from DLL Hell with Custom Debugging and Instrumentation Tools and Utilities, Part 2” 的一篇文章(网址为 http://msdn.microsoft.com/msdnmag/issues/02/08/EscapefromDLLHell/)所解释的那样，要找到 命令行，需要深入研究远程进程的“进程环境块”(Process Environment Block, PEB)。不 过，自Windows XP起发生了两个重要的变化，我们需要对此专门解释一下。
首先，在 WinDbg(可从 http://www.microsoft.com/whdc/devtools/debugging/default.mspx 下载) 中，用于获得一个内核风格的PEB结构相关详情的命令已经发生了变化。现在不再使用
第4章进程
kdex2x86扩展所实现的“strct”。相反，我们只需调用“dt”命令。例如，执行“dtnt! PEB”, 将列出以下PEB定义：
+0x000 InheritedAddressSpace : UChar
+0x001 ReadlmageFi1eExecOptions : UChar
+0x002 BeingDebugged : UChar
+0x003 BitField : UChar
+0x003 ImageUsesLargePages : Pos 0, 1 Bit
+0x003 IsProtectedProcess : Pos 1, 1 Bit
+0x003 IsLegacyProcess : Pos 2, 1 Bit
+0x003 IsImageDynamica1lyRelocated : Pos 3, 1 Bit
+0x003 SpareBits : Pos 4, 4 Bits
+0x004 Mutant : Ptr32 Void
+0x008 ImageBaseAddress : Ptr32 Void
+0x00c Ldr : Ptr32 _PEB_LDR_DATA
♦0x010 ProcessParanetara : Ptr32 JRTL_USKI<_PROCBSS_PARAMBTERS
+0x014 SubSystemData : Ptr32 Void
,+0x018 ProcessHeap : Ptr32 Void
RTL_USER_PROCESS_PARAMETERS 结构的定义如下，这是由 WinDbg 中的。dt nt!_RTL_USER_PROCESS_PARAMETERS ” 命令所列出的：
+0x000 MaximumLength : Uint4B
+0x004 Length : Uint4B
+0x008 Flags : Uint4B
+0x00c DebugFlags : Uint4B
+0x010 ConsoleHandle : Ptr32 Void
+0x014 ConsoleFlags : Uint4B
+0x018 Standardinput : Ptr32 Void
+0x01c Standardoutput : Ptr32 Void
+0x020 StandardError : Ptr32 Void
+0x024 CurrentDirectory : _CURDIR
+0x030 DllPath : _UNICODE_STRING
+0x038 ImagePathName : _UNICODE_STRING
*0x040 Comna&dLine t _U»ICODE_STRING
+0x048 Environment : Ptr32 Void
这样一来，就可以对以下内部结构进行计算，从而帮助我们“挖掘”出命令行:
typedef struct
(
DWORD Filler[4]；
DWORD InfoBlockAddress;
} _PEB;
typedef struct
(
DWORD Filler(17];
DWORD wszCmdLineAddress;
} _INFOBLOCK;
其次，如同第14章要讲到的那样，在Windows Vista中，系统会将DLL载入进程地址空间 中的随机地址。所以，不要像在Windows XP中那样将PEB的地址硬编码为0x7fWfD00。
相反，我们需要调用NtQuerylnformationProcess ,并在第二个参数中传入 ProcessBasicInformationo别忘了，在一个版本的Windows中发现的未公开的细节可能在下 一个版本中发生改变，PEB的地址就是一例。
最后但同样很重要的一点，在使用Process Information应用程序时，我们会注意到某些进程
ows核心编程(第5版)
己在组合框中列出，但它没有显示已加载的DLL之类的详细信息。例如， audiodg.exe(Windows Audio Device Graph Isolation)就是一个受保护的进程。这种新的进 程类型是从Windows Vista开始引入的。例如，可以用它为DRM(数字权限保护)应用 程序提供更大程度的隔离。另外，理所当然地，远程进程访问受保护进程的虚拟内存 的权限也被取消了。由于这个权限是列出已加载的DLL所必须的，所以ToolHelp API 自然无法返回这些细节了。可从以下网址下载受保护进程的白皮书： http://www.microsoft.com/whdc/system/vista/process_Vista.mspxo
